Revit 2026 API

# IFCTransformSetterInitialize Method

---

Initializes the transformation in the transform setter.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Initialize(
	ExporterIFC exporterIFC,
	Transform transform
)
```
```vb
Public Sub Initialize (
	exporterIFC As ExporterIFC,
	transform As Transform
)
```
```cpp
public:
void Initialize(
	ExporterIFC^ exporterIFC,
	Transform^ transform
)
```
```fsharp
member Initialize :
        exporterIFC : ExporterIFC *
        transform : Transform -> unit
```

#### Parameters

exporterIFC ExporterIFC
     The exporter.
transform Transform
     The transform.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace